//1

//let arr = ["пн",   "вт",   "ср",   "чт",   "пт",   "сб",   "вс"]
//alert(arr [0] + "   " + arr[4] + "  экзамен   "  )

//2
//let arr =["женя ,","саша ","дана,","вова"]
//alert(arr [0] + "   " + arr[2] + "    " +arr[3] + "  получат   "   )
//alert( arr[1] + "  не получит")


//3
//ассоциативный массив
//obj = {"Женя":"20000", "Дана":"45000", "Богдан":"300000" }
//alert(obj["Богдан"])

//4
//ассоциативный массив двух фазовый
//arr = {
  //  "женя":["10000", "15000" ,"20000"],
   //// "саша":["100000", "150000", "200000","35000"]
//}
//alert(arr ["саша"]  [3] )


//arr = {
   // "мальчик":["влад ", "данил  " ,"витя  "],
   // "девочка":["ира", "адель   ", "мия","кира"]
//}
//alert(arr ["мальчик"]  [1] + arr ["девочка"] [1] + arr ["мальчик"]  [2])


//5
//let a = 1
//arr = [2,3,4,5]
//for(i = 0; i < 4; i++){
   // a = arr [i] * a
//}
//alert(a)